name = input("Введіть своє ім'я: ")
age = input("Введіть своє вік: ")
nation = input("Введіть свою національність: ")
hobby = input("Перечисліть свої хобі: ")
free_time = input("Напишіть чим любите займатися у вільний час: ")
favorite_subject = input("Напишіть улюблений предмет у школі: ")
behaviour = input("Опишіть свій характер, Я... : ")

has_pet = input("У вас є домашній улюбленець?(Так / Ні)")
if(has_pet == "Так"):
    pet = input("Хто це(собака, кіт, папуга): ")
    pet_name = input("Ім'я вашого улюбленця: ")
    print(f"Привіт! Мене звати {name}. Мені {age} років. Я {nation}.  З хобі в мене: {hobby}. Свій вільний час я трачу на: {free_time}. Мої улюблені предмети в школі це: {favorite_subject}. Я {behaviour}. Також в мене є {pet} на ім'я {pet_name}. На цьому все. Бувай!")
else: 
    print(f"Привіт! Мене звати {name}. Мені {age} років. Я {nation}.  З хобі в мене: {hobby}. Свій вільний час я трачу на: {free_time}. Мої улюблені предмети в школі це: {favorite_subject}. Я {behaviour}. На цьому все. Бувай!")




